### YamlMime:FAQ
metadata:
  title: Frequently asked questions (FAQs) on tamper protection 
  description: Find answers to frequently asked questions
  ms.service: microsoft-365-security
  ms.subservice: mde
  ms.localizationpriority: medium
  audience: ITPro
  author: denisebmsft
  ms.author: deniseb
  ms.reviewer: joshbregman, sugamar 
  manager: dansimp
  ms.custom: asr
  ms.topic: faq
  ms.collection: m365-security
  ms.date: 06/23/2023
title: Frequently asked questions (FAQs) on tamper protection 
summary: | 

  **Applies to:**

  - [Microsoft Defender for Endpoint Plan 1](https://go.microsoft.com/fwlink/p/?linkid=2154037)
  - [Microsoft Defender for Endpoint Plan 2](https://go.microsoft.com/fwlink/p/?linkid=2154037)
  - [Microsoft Defender Antivirus](microsoft-defender-antivirus-windows.md)
  - [Microsoft Defender for Business](../defender-business/mdb-overview.md)
  - [Microsoft 365 Business Premium](../../business-premium/index.md)

  **Platforms**

  - Windows

sections:
  - name: Ignored
    questions:
      - question: |
          On which versions of Windows can I configure tamper protection?
        answer: |
          - Windows 11
          - Windows 11 Enterprise multi-session
          - Windows 10 OS [1709](/lifecycle/announcements/revised-end-of-service-windows-10-1709), [1803](/lifecycle/announcements/windows-server-1803-end-of-servicing), [1809](/windows/release-health/status-windows-10-1809-and-windows-server-2019), or later together with [Microsoft Defender for Endpoint](/microsoft-365/security/defender-endpoint).
          - Windows 10 Enterprise multi-session
  
          If you're using Configuration Manager, version 2006, with tenant attach, tamper protection can be extended to Windows Server 2012 R2, Windows Server 2016, Windows Server 2019, and Windows Server 2022. See [Tenant attach: Create and deploy endpoint security Antivirus policy from the admin center (preview)](/mem/configmgr/tenant-attach/deploy-antivirus-policy).

      - question: |
          Does tamper protection affect non-Microsoft Antivirus registration in the Windows Security app?
        answer: |
          No. Non-Microsoft Antivirus offerings continue to register with the Windows Security application.

      - question: |
          What happens if Microsoft Defender Antivirus isn't active on a device?
        answer: |
          If non-Microsoft antivirus/antimalware software is installed on a device, when that device is onboarded to Microsoft Defender for Endpoint, Microsoft Defender Antivirus runs in passive mode by default. In this case, tamper protection continues to protect the service and its features.

          If/when non-Microsoft antivirus/antimalware software is uninstalled, Microsoft Defender Antivirus switches to active mode automatically. Tamper protection continues to protect the service and its features.

      - question: |
          How do I turn tamper protection on or off?
        answer: |
          We recommend using [Microsoft Intune](/mem/intune/fundamentals/what-is-intune) to manage Microsoft Defender Antivirus settings for your organization. With Intune, you can control where tamper protection is enabled (or disabled) through policies. You can also protect Microsoft Defender Antivirus exclusions. See [Tamper protection: Microsoft Defender Antivirus exclusions](prevent-changes-to-security-settings-with-tamper-protection.md#protect-microsoft-defender-antivirus-exclusions).
          
          If you're an organization using [Microsoft Defender for Endpoint](/microsoft-365/security/defender-endpoint), you can choose from several options to manage tamper protection:

          - [Use Microsoft Intune](manage-tamper-protection-intune.md)
          - [Use the Microsoft 365 Defender portal](manage-tamper-protection-microsoft-365-defender.md)
          - [Use Configuration Manager](manage-tamper-protection-configuration-manager.md)
          
          Tamper protection is part of [built-in protection](built-in-protection.md), and should be enabled. 

          If you're a home user, see [Manage tamper protection on an individual device](manage-tamper-protection-individual-device.md).

      - question: |
          Does tamper protection apply to Microsoft Defender Antivirus exclusions?
        answer: |
          New functionality is rolling out now to protect Microsoft Defender Antivirus exclusions on devices. Certain conditions must be met. For example, your organization must be managing devices with Intune. See [Protect Microsoft Defender Antivirus exclusions](prevent-changes-to-security-settings-with-tamper-protection.md#protect-microsoft-defender-antivirus-exclusions)? 

      - question: |
          How does configuring tamper protection in Intune affect how I manage Microsoft Defender Antivirus with Group Policy?
        answer: |
          If you're currently using Intune to configure and manage tamper protection, you should continue using Intune. When tamper protection is turned on and you use Group Policy to make changes to Microsoft Defender Antivirus settings, any settings that are protected by tamper protection are ignored. 

          When tamper protection is turned on, the tamper-protected settings cannot be changed, even if those changes appear to be successful. Depending on your particular scenario, you have several options available: 
          
          - If you must make changes to a device and those changes are blocked by tamper protection, you can use [troubleshooting mode](/microsoft-365/security/defender-endpoint/enable-troubleshooting-mode) to temporarily disable tamper protection on the device. After troubleshooting mode ends, any changes made to tamper-protected settings are reverted to their configured state.
          - You can use Intune or Configuration Manager to exclude devices from tamper protection. 
          - If you're managing tamper protection through Intune and certain other conditions are met, you can [manage tamper-protected antivirus exclusions](manage-tamper-protection-intune.md#tamper-protection-for-antivirus-exclusions).

      - question: |
          If we use Microsoft Intune to configure tamper protection, does it apply only to the entire organization?
        answer: |
          If you're using Intune to configure and manage tamper protection, you do not necessarily have to apply tamper protection to your entire organization. With Intune, you can choose to apply tamper protection to your entire organization, or you can select specific devices or user groups to receive tamper protection. You can also exclude specific devices from tamper protection.

      - question: |
          What settings can't be changed when tamper protection is turned on?
        answer: |
          When tamper protection is turned on, the following security settings are protected from being changed: 
          
          - Virus and threat protection remains enabled.
          - Real-time protection remains turned on.
          - Behavior monitoring remains turned on.
          - Antivirus protection, including IOfficeAntivirus (IOAV) remains enabled.
          - Cloud protection remains enabled.
          - Security intelligence updates continue to occur.
          - Automatic actions are taken on detected threats.
          - Notifications are visible in the Windows Security app on Windows devices.
          - Archived files are scanned. 
          
          For more information, see [What happens when tamper protection is turned on](/microsoft-365/security/defender-endpoint/prevent-changes-to-security-settings-with-tamper-protection#what-happens-when-tamper-protection-is-turned-on)?

      - question: |
          If tamper protection is turned on in Microsoft 365 Defender, can Intune or Configuration Manager override it?
        answer: |
          When tamper protection is turned on in the Microsoft 365 Defender portal ([https://security.microsoft.com](https://security.microsoft.com)), tamper protection is turned on, tenant wide. However, policies defined in Intune or Configuration Manager can override settings in the Microsoft 365 Defender portal. For example, you can define a policy in Intune or Configuration Manager that excludes certain devices from tamper protection. 

      - question: |
          How do I deploy DisableLocalAdminMerge?
        answer: |
          Use Intune to deploy [DisableLocalAdminMerge](/windows/client-management/mdm/defender-csp).

      - question: |
          How can I confirm whether exclusions are tamper protected on a Windows device?
        answer: |
         1. On a Windows device open Registry Editor. (Read-only mode is fine; don't edit the registry key.)
         
         2. Go to `Computer\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows Defender\Features` (or `HKLM\SOFTWARE\Microsoft\Windows Defender\Features`), and look for a `REG_DWORD` entry called **TPExclusions**. 

          - If **TPExclusions** has a value of `1`, then all required conditions are met, and the new functionality to protect exclusions is enabled on the device. In this case, exclusions are tamper protected.
          - If **TPExclusions** has a value of `0`, then tamper protection isn't currently protecting exclusions on the device. In this case, review the requirements in [Tamper protection for antivirus exclusions](/microsoft-365/security/defender-endpoint/manage-tamper-protection-intune#tamper-protection-for-antivirus-exclusions).

          > [!CAUTION]
          > Don't change the value of **TPExclusions**. Use the preceding procedure for information only. Changing the key has no effect on whether tamper protection applies to exclusions.

      - question: |
          Can I configure tamper protection with Microsoft Configuration Manager?
        answer: |
          If you're using tenant attach, you can configure tamper protection with Configuration Manager. Similar to using Intune, you can apply tamper protection to your whole organization, or to specific users and devices. For more information, see the following resources:

          - [Manage tamper protection using tenant attach with Configuration Manager, version 2006](manage-tamper-protection-configuration-manager.md)
          - [Tech Community blog: Announcing Tamper Protection for Configuration Manager Tenant Attach clients](https://techcommunity.microsoft.com/t5/microsoft-endpoint-manager-blog/announcing-tamper-protection-for-configuration-manager-tenant/ba-p/1700246#.X3QLR5Ziqq8.linkedin)

      - question: |
          I'm an enterprise customer. Can local admins change tamper protection on their devices?
        answer: |
          In general, tamper protection helps protect against users being able to change security settings directly on devices. Tamper protection is part of anti-tampering capabilities that include [standard protection attack surface reduction rules](attack-surface-reduction-rules-reference.md). To further prevent malware from running in kernel, consider using [driver block rules with Application Control for Windows](/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules).

      - question: |
          What happens if my device is onboarded with Microsoft Defender for Endpoint and then goes into an off-boarded state?
        answer: |
          If a device is off-boarded from Microsoft Defender for Endpoint, tamper protection is turned on, which is the default state for unmanaged devices.

        
      - question: |
          If the status of tamper protection changes, are alerts shown in the Microsoft 365 Defender portal?
        answer: |
          Alerts should be listed in the [Microsoft 365 Defender portal](https://security.microsoft.com) under **Alerts**.

          Your security operations team can also use hunting queries, such as the following example:

          `AlertInfo|where Title == "Tamper Protection bypass"`

      - question: |
          What are all the options for configuring the tamper protection?
        answer: |
          You can use any of the following methods to configure tamper protection:
          - The [Microsoft 365 Defender portal](manage-tamper-protection-microsoft-365-defender.md) (turn tamper protection on or off, tenant wide)
          - [Intune](manage-tamper-protection-microsoft-endpoint-manager.md) (turn tamper protection on or off, and/or configure tamper protection for some or all users)
          - [Configuration Manager](manage-tamper-protection-configuration-manager.md) (with tenant attach, you can configure tamper protection for some or all devices by using the Windows Security experience profile)
          - [Windows Security app](manage-tamper-protection-individual-device.md) (for an individual device used at home or that isn't centrally managed by a security team)
          > [!NOTE]
           > We recommend keeping tamper protection turned on for your whole organization. If tamper protection prevents your IT or security team from performing a necessary task on a device, 
            consider using [troubleshooting mode](enable-troubleshooting-mode.md) instead of disabling tamper protection.
 

