### YamlMime:FAQ
metadata:
  title: Frequently asked questions on tamper protection (FAQ)
  description: Find answers to frequently asked questions
  ms.pagetype: security
  ms.service: microsoft-365-security
  ms.subservice: mde
  ms.mktglfcycl: manage
  ms.sitesec: library
  ms.localizationpriority: medium
  audience: ITPro
  author: dansimp
  ms.author: dansimp
  ms.reviewer: oogunrinde, sugamar 
  manager: dansimp
  ms.custom: asr
  ms.topic: faq
  ms.collection: m365-security
  ms.date: 04/04/2023

title: Frequently asked questions on tamper protection (FAQ)


  **Applies to:**

    - [Microsoft Defender for Endpoint Plan 1](https://go.microsoft.com/fwlink/p/?linkid=2154037)
    - [Microsoft Defender for Endpoint Plan 2](https://go.microsoft.com/fwlink/p/?linkid=2154037)
    - [Microsoft Defender Antivirus](microsoft-defender-antivirus-windows.md)
    - [Microsoft Defender for Business](../defender-business/mdb-overview.md)
    - [Microsoft 365 Business Premium](../../business-premium/index.md)

   **Platforms**
    - Windows

sections:
  - name: Ignored
    questions:
      - question: |
          On which versions of Windows can I configure tamper protection?
        answer: |
          - Windows 11
          - Windows 11 Enterprise multi-session
          - Windows 10 OS [1709](/lifecycle/announcements/revised-end-of-service-windows-10-1709), [1803](/lifecycle/announcements/windows-server-1803-end-of-servicing), [1809](/windows/release-health/status-windows-10-1809-and-windows-server-2019), or later together with [Microsoft Defender for Endpoint](/microsoft-365/security/defender-endpoint).
          - Windows 10 Enterprise multi-session
  
          If you're using Configuration Manager, version 2006, with tenant attach, tamper protection can be extended to Windows Server 2012 R2, Windows Server 2016, Windows Server 2019, and Windows Server 2022. See [Tenant attach: Create and deploy endpoint security Antivirus policy from the admin center (preview)](/mem/configmgr/tenant-attach/deploy-antivirus-policy).

      - question: |
          Will tamper protection affect non-Microsoft antivirus registration in the Windows Security app?
        answer: |
          No. Non-Microsoft antivirus offerings continue to register with the Windows Security application.

      - question: |
          What happens if Microsoft Defender Antivirus isn't active on a device?
        answer: |
          Devices that are onboarded to Microsoft Defender for Endpoint has Microsoft Defender Antivirus running in passive mode. In these cases, tamper protection continues to protect the service and its features.

      - question: |
          How do I turn tamper protection on or off?
        answer: |
          If you're an organization using [Microsoft Defender for Endpoint](/microsoft-365/security/defender-endpoint), you should be able to manage tamper protection in Intune similar to how you manage other endpoint protection features. See the following sections of this article:
          - [Manage tamper protection using Microsoft Intune](manage-tamper-protection-microsoft-endpoint-manager.md)
          - [Manage tamper protection using Microsoft 365 Defender](manage-tamper-protection-microsoft-365-defender.md)
          
          If you're a home user, see [Manage tamper protection on an individual device](manage-tamper-protection-individual-device.md).

      - question: |
          Does tamper protection apply to Microsoft Defender Antivirus exclusions?
        answer: |
          New functionality is rolling out now to protect Microsoft Defender Antivirus exclusions on devices that are managed by Intune. Certain conditions must be met. See [What about exclusions](prevent-changes-to-security-settings-with-tamper-protection.md#what-about-exclusions)? 

      - question: |
          How does configuring tamper protection in Intune affect how I manage Microsoft Defender Antivirus with Group Policy?
        answer: |
          If you're currently using Intune to configure and manage tamper protection, you should continue using Intune. When tamper protection is turned on and you use Group Policy to make changes to Microsoft Defender Antivirus settings, any settings that are protected by tamper protection will be ignored. 

      - question: |
          If we use Microsoft Intune to configure tamper protection, does it apply only to the entire organization?
        answer: |
          If you're using Intune to configure and manage tamper protection, you can target your entire organization, or select specific devices and user groups.

      - question: |
          What settings can't be changed when tamper protection is turned on?
        answer: |
          When tamper protection is turned on, tamper-protected settings can't be changed from their default value, even if you're using Intune to manage your security settings. Changes might appear to be successful in Intune, but won't actually be allowed by tamper protection. For the most current list of tamper protected settings, contact support.

      - question: |
          If tamper protection is turned on in Microsoft 365 Defender, can Intune override it?
        answer: |
          A tamper protection policy defined in Intune can override tamper protection that is turned on in the Microsoft 365 Defender portal. Policies defined in Intune take priority. Affected devices must be part of a device group that is included in the Intune policy.

      - question: |
          How do I deploy DisableLocalAdminMerge?
        answer: |
          Use Intune to deploy [DisableLocalAdminMerge](/windows/client-management/mdm/defender-csp).

      - question: |
          How can I confirm whether exclusions are tamper protected on a Windows device?
        answer: |
         1. On a Windows device open Registry Editor. (Read-only mode is fine; you won't be editing the registry key.)
         2. Go to `Computer\HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows Defender\Features` (or `HKLM\SOFTWARE\Microsoft\Windows Defender\Features`), and look for a `REG_DWORD` entry called **TPExclusions**. 

          - If **TPExclusions** has a value of `1`, then all required conditions are met, and the new functionality to protect exclusions is enabled on the device. In this case, exclusions are tamper protected.
          - If **TPExclusions** has a value of `0`, then tamper protection isn't currently protecting exclusions on the device.

          > [!CAUTION]
          > Do not change the value of **TPExclusions**. Use the preceding procedure for information only. Changing the key will have no effect on whether tamper protection applies to exclusions.

      - question: |
          Can I configure tamper protection with Microsoft Configuration Manager?
        answer: |
          If you're using tenant attach, you can use Microsoft Configuration Manager. See the following resources:
          - [Manage tamper protection using tenant attach with Configuration Manager, version 2006](manage-tamper-protection-configuration-manager.md)
          - [Tech Community blog: Announcing Tamper Protection for Configuration Manager Tenant Attach clients](https://techcommunity.microsoft.com/t5/microsoft-endpoint-manager-blog/announcing-tamper-protection-for-configuration-manager-tenant/ba-p/1700246#.X3QLR5Ziqq8.linkedin)

      - question: |
          I have the Windows E3 enrollment. Can I use configuring tamper protection in Intune?
        answer: |
          Currently, configuring tamper protection in Intune is only available for customers whose subscriptions include [Microsoft Defender for Endpoint](/microsoft-365/security/defender-endpoint).

      - question: |
          I'm an enterprise customer. Can local admins change tamper protection on their devices?
        answer: |
          In general, tamper protection helps protect against users being able to change security settings directly on devices. Tamper protection is part of anti-tampering capabilities that include [standard protection attack surface reduction rules](attack-surface-reduction-rules-reference.md). To further prevent malware from running in kernel, consider using  [driver block rules with Application Control for Windows](/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules).

      - question: |
          What happens if my device is onboarded with Microsoft Defender for Endpoint and then goes into an off-boarded state?
        answer: |
          If a device is off-boarded from Microsoft Defender for Endpoint, tamper protection is turned on, which is the default state for unmanaged devices.

        
      - question: |
          If the status of tamper protection changes, are alerts shown in the Microsoft 365 Defender portal?
        answer: |
          Alerts should be listed in the [Microsoft 365 Defender portal](https://security.microsoft.com) under **Alerts**.

          Your security operations team can also use hunting queries, such as the following example:

          `AlertInfo|where Title == "Tamper Protection bypass"`

          > [!TIP]
          > If you're looking for Antivirus related information for other platforms, see:
          > - [Set preferences for Microsoft Defender for Endpoint on macOS](mac-preferences.md)
          > - [Microsoft Defender for Endpoint on Mac](microsoft-defender-endpoint-mac.md)
          > - [macOS Antivirus policy settings for Microsoft Defender Antivirus for Intune](/mem/intune/protect/antivirus-microsoft-defender-settings-macos)
          > - [Set preferences for Microsoft Defender for Endpoint on Linux](linux-preferences.md)
          > - [Microsoft Defender for Endpoint on Linux](microsoft-defender-endpoint-linux.md)
          > - [Configure Defender for Endpoint on Android features](android-configure.md)
          > - [Configure Microsoft Defender for Endpoint on iOS features](ios-configure-features.md)

      - question: |
          What are all the options for configuring the tamper protection?
        answer: |
          You can use any of the following methods to configure tamper protection:
          - The [Microsoft 365 Defender portal](manage-tamper-protection-microsoft-365-defender.md) (turn tamper protection on or off, tenant wide)
          - [Intune](manage-tamper-protection-microsoft-endpoint-manager.md) (turn tamper protection on or off, and/or configure tamper protection for some or all users)
          - [Configuration Manager](manage-tamper-protection-configuration-manager.md) (with tenant attach, you can configure tamper protection for some or all devices by using the Windows Security experience profile)
          - [Windows Security app](manage-tamper-protection-individual-device.md) (for an individual device used at home or that isn't centrally managed by a security team)
          > [!NOTE]
           > We recommend keeping tamper protection turned on for your whole organization. If tamper protection prevents your IT or security team from performing a necessary task on a device, 
            consider using [troubleshooting mode](enable-troubleshooting-mode.md) instead of disabling tamper protection.
 

