---
title: UrlClickEvents table in the advanced hunting schema
description: Learn how to hunt for phishing campaigns and suspicious clicks using the UrlClickEvents table in the advanced hunting schema.
keywords: advanced hunting, threat hunting, cyber threat hunting, Microsoft 365 Defender, microsoft 365, m365, search, query, telemetry, schema reference, kusto, table, column, data type, description, UrlClickEvents, SafeLinks, phishing, malware, malicious clicks, outlook, teams, email, office365
search.product: eADQiWindows 10XVcnh
search.appverid: met150
ms.service: microsoft-365-security
ms.subservice: m365d
ms.mktglfcycl: deploy
ms.sitesec: library
ms.pagetype: security
f1.keywords: 
  - NOCSH
ms.author: maccruz
author: schmurky
ms.localizationpriority: medium
manager: dansimp
audience: ITPro
ms.collection: 
- m365-security
- tier3
ms.topic: conceptual
ms.date: 04/27/2022
---

# UrlClickEvents

[!INCLUDE [Microsoft 365 Defender rebranding](../includes/microsoft-defender.md)]


**Applies to:**
- Microsoft 365 Defender


The `UrlClickEvents` table in the advanced hunting schema contains information about [Safe Links](../office-365-security/safe-links-about.md) clicks from email messages, Microsoft Teams, and Office 365 apps in supported desktop, mobile, and web apps.

> [!IMPORTANT]
> This table is currently in public preview. Some information relates to a prereleased feature which may be substantially modified before it's commercially released. Microsoft makes no warranties, express or implied, with respect to the information provided here.

For information on other tables in the advanced hunting schema, see [the advanced hunting reference](advanced-hunting-schema-tables.md).

| Column name | Data type | Description |
|-------------|-----------|-------------|
| `Timestamp` | `datetime` | The date and time when the user clicked on the link |
| `Url` | `string` | The full URL that was clicked on by the user |
| `ActionType` | `string` | Indicates whether the click was allowed or blocked by Safe Links or blocked due to a tenant policy, for instance, from Tenant Allow Block list|
| `AccountUpn` | `string` | User Principal Name of the account that clicked on the link|
| `Workload` | `string` | The application from which the user clicked on the link, with the values being Email, Office, and Teams|
| `NetworkMessageId` | `string` | The unique identifier for the email that contains the clicked link, generated by Microsoft 365|
| `IPAddress` | `string` | Public IP address of the device from which the user clicked on the link|
| `ThreatTypes` | `string` | Verdict at the time of click, which tells whether the URL led to malware, phish or other threats|
| `DetectionMethods` | `string` | Detection technology that was used to identify the threat at the time of click|
| `IsClickedThrough` | `bool` | Indicates whether the user was able to click through to the original URL (1) or not (0)|
| `UrlChain` | `string` | For scenarios involving redirections, it includes URLs present in the redirection chain|
| `ReportId` | `string` | The unique identifier for a click event. For clickthrough scenarios, report ID would have same value, and therefore it should be used to correlate a click event.|


You can try this example query that uses the `UrlClickEvents` table to return a list of links where a user was allowed to proceed: 

```kusto
// Search for malicious links where user was allowed to proceed through
UrlClickEvents
| where ActionType == "ClickAllowed" or IsClickedThrough !="0"
| where ThreatTypes has "Phish"
| summarize by ReportId, IsClickedThrough, AccountUpn, NetworkMessageId, ThreatTypes, Timestamp
```

## Related articles
- [Supported Microsoft 365 Defender streaming event types in event streaming API](supported-event-types.md)
- [Proactively hunt for threats](advanced-hunting-overview.md)
- [Safe Links in Microsoft Defender for Office 365](../office-365-security/safe-links-about.md)
- [Take action on advanced hunting query results](advanced-hunting-take-action.md)
[!INCLUDE [Microsoft 365 Defender rebranding](../../includes/defender-m3d-techcommunity.md)]
